scc2425-project-71903-71911/src/main/artillery/following/getFollowers.yml
config:
  target: "http://localhost:8080/tukano/rest"
  phases:
    - name: get followers
      duration: 6
      arrivalRate: 2

scenarios:
  - name: "register"
    flow:
      - post:
          url: "/users"
          json:
            id: "12"
            pwd: "123"
            email: "user123@gmail.com"
            displayName: "UserXDD"
  - name: "register"
    flow:
      - post:
          url: "/users"
          json:
            id: "13"
            pwd: "123"
            email: "user456@gmail.com"
            displayName: "UserXXD"
  - name: "follow"
    flow:
      - post:
          url: "/following/12/13/followers?pwd=123"
          json: true
  - name: "get followers"
    flow:
      - get:
          url: "/following/13/followers?pwd=123"